165/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

165/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

165/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВзаиморасчетыОстатки.Соглашение, 0) КАК Соглашение,
	|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыОстатки.СуммаUSDОстаток КАК СуммаUSDОстаток,
	|	ВзаиморасчетыОстатки.СуммаEURОстаток КАК СуммаEURОстаток,
	|	ЕСТЬNULL(Соглашения.ДатаОплаты, 0) КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Соглашения КАК Соглашения
	|		ПО ВзаиморасчетыОстатки.Соглашение = Соглашения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Поставщик);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Соглашение = Соглашение;
		Движение.Контрагент = Поставщик;
		Движение.Сумма = СуммаПоДокументу;
		Движение.СуммаUSD = СуммаUSD;
		Движение.СуммаEUR = СуммаEUR;
	КонецЕсли;
	СуммыКЗаписи = Новый Структура;
	СуммыКЗаписи.Вставить("Руб", СуммаПоДокументу);
	СуммыКЗаписи.Вставить("Дол", СуммаUSD);
	СуммыКЗаписи.Вставить("Евр", СуммаEUR);	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() И НЕ ЗначениеЗаполнено(Выборка.Соглашение) И СуммыКЗаписи.Руб > 0 Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Если СуммыКЗаписи.Руб < Выборка.СуммаОстаток Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		ИначеЕсли СуммыКЗаписи.Руб = Выборка.СуммаОстаток Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = Выборка.СуммаОстаток;
			Движение.СуммаUSD = Выборка.СуммаUSDОстаток;
			Движение.СуммаEUR = Выборка.СуммаEURОстаток;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			СуммыКЗаписи.Руб = СуммыКЗаписи.Руб - Выборка.СуммаОстаток;
			СуммыКЗаписи.Дол = СуммыКЗаписи.Дол - Выборка.СуммаUSDОстаток;
			СуммыКЗаписи.Евр = СуммыКЗаписи.Евр - Выборка.СуммаEURОстаток;
			Движение.Сумма = Выборка.СуммаОстаток;
			Движение.СуммаUSD = Выборка.СуммаUSDОстаток;
			Движение.СуммаEUR = Выборка.СуммаEURОстаток;			
		КонецЕсли;
	КонецЦикла;
	Пока Выборка.Следующий() И СуммыКЗаписи.Руб > 0 Цикл
		Если ЗначениеЗаполнено(Соглашение) Тогда
			Движение = Движения.Взаиморасчеты.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = Поставщик;
			Движение.Соглашение = Соглашение;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		Иначе
			Движение = Движения.Взаиморасчеты.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = Поставщик;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		КонецЕсли;
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
